Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: /%@ needs a query: type one in the editor or after the command.
fr: /%@ nécessite une requête : saisissez-en une dans l’éditeur ou après la commande.
ko: /%@ 명령에는 쿼리가 필요합니다. 편집기 또는 명령 뒤에 쿼리를 입력하십시오.
tr: /%@ bir sorgu gerektirir: düzenleyiciye veya komutun ardına bir sorgu yazın.
vi: /%@ cần một truy vấn: nhập vào trình soạn thảo hoặc sau lệnh.
zh_hans: /%@需要一个查询：请在编辑器中或命令后输入。
zh_hant: /%@ 需要一個查詢：請在編輯器中或指令後輸入。

source: Granted
fr: Accordé
ko: 부여됨
tr: Verildi
vi: Đã cấp
zh_hans: 已授予
zh_hant: 已授予

source: The server answered with HTTP %d.
fr: Le serveur a répondu avec HTTP %d.

source: A copy to another engine needs a type system TablePro can translate, and %@ has none it knows. Copy to a target of the same type.
fr: Une copie vers un autre moteur nécessite un système de type que TablePro peut traduire, et %@ n'en a aucun qu'il connaisse. Copiez vers une cible du même type.

source: PostgreSQL %1$@ needs %2$@ %3$@ or later.
fr: PostgreSQL %1$@ nécessite %2$@ %3$@ ou plus récent.

source: Missing Profile
fr: Profil manquant

source: Deleted
fr: Supprimé
ko: 삭제됨
tr: Silindi
vi: Đã xoá
zh_hans: 已删除
zh_hant: 已刪除

source: Dismiss error
fr: Désapprouver l'erreur
ko: 오류 닫기
tr: Hatayı kapat
vi: Bỏ qua lỗi
zh_hans: 关闭错误
zh_hant: 關閉錯誤

source: username
fr: nom d'utilisateur
ko: 사용자 이름

source: Top Level
fr: Niveau supérieur
ko: 최상위
tr: Üst Düzey
vi: Cấp cao nhất
zh_hans: 顶级
zh_hant: 頂層

source: The passwords do not match.
fr: Les mots de passe ne correspondent pas.
ko: 암호가 일치하지 않습니다.
tr: Parolalar eşleşmiyor.
vi: Mật khẩu không khớp.
zh_hans: 两次输入的密码不一致。
zh_hant: 兩次輸入的密碼不一致。

source: Every 5 minutes
fr: Chaque 5 minutes

source: Favorite
fr: Favori
ko: 즐겨찾기
tr: Sık Kullanılan
vi: Yêu thích
zh_hans: 收藏
zh_hant: 我的最愛

source: Passphrase
fr: Phrase de passe
ko: 암호 구문
vi: Cụm mật khẩu
zh_hans: 密码短语
zh_hant: 通關密語

source: Ask about this change…
fr: Demandez à propos de ce changement...
ko: 이 변경 사항에 대해 질문…
tr: Bu değişiklik hakkında soru sor…
vi: Hỏi về thay đổi này…
zh_hans: 询问此更改…
zh_hant: 詢問這項變更…

source: Use Required for Amazon Keyspaces and other hosted Cassandra deployments.
fr: Utilisé nécessaire pour les espaces clés Amazon et d'autres déploiements Cassandra hébergés.

source: No matching rows
fr: Aucune ligne correspondante
ko: 일치하는 행 없음
tr: Eşleşen satır yok
vi: Không có hàng khớp
zh_hans: 没有匹配的行
zh_hant: 沒有符合的列

source: Remove from Group
fr: Supprimer du groupe
ko: 그룹에서 제거
tr: Gruptan Çıkar
vi: Xóa khỏi Nhóm
zh_hans: 从分组移除
zh_hant: 從群組移除

source: Schema the tab is on
fr: Schéma sur lequel se trouve l'onglet
ko: 탭이 사용 중인 스키마
tr: Sekmenin bulunduğu şema
vi: Schema mà tab đang dùng
zh_hans: 该标签页所在的 Schema
zh_hant: 該標籤頁所在的綱要

source: No filters applied
fr: Aucun filtre appliqué
ko: 적용된 필터 없음
tr: Uygulanmış filtre yok
vi: Chưa áp dụng bộ lọc
zh_hans: 未应用筛选条件
zh_hant: 未套用篩選條件

source: Get the CREATE TABLE DDL statement for a table
fr: Obtenez la déclaration CREATE TABLE DDL pour une table.
ko: 테이블의 CREATE TABLE DDL 문 가져오기
tr: Bir tablonun CREATE TABLE DDL deyimini al
vi: Lấy câu lệnh DDL CREATE TABLE của một bảng
zh_hans: 获取表的 CREATE TABLE DDL 语句
zh_hant: 取得資料表的 CREATE TABLE DDL 陳述式

source: Plugin not found
fr: Plugin non trouvé
ko: 플러그인을 찾을 수 없음
tr: Eklenti bulunamadı
vi: Không tìm thấy plugin
zh_hans: 未找到插件
zh_hant: 找不到外掛

source: Two-Factor Authentication
fr: Authentification à deux facteurs
ko: 2단계 인증
tr: İki Aşamalı Doğrulama
vi: Xác thực hai yếu tố
zh_hans: 双因素认证
zh_hant: 雙重驗證

source: New Database…
fr: Nouvelle base de données...
ko: 새 데이터베이스…
tr: Yeni Veritabanı…
vi: Cơ sở dữ liệu mới…
zh_hans: 新建数据库…
zh_hant: 新增資料庫…

source: Forever
fr: Pour toujours
ko: 무기한
tr: Süresiz
vi: Mãi mãi
zh_hans: 永久
zh_hant: 永久

source: JSON Too Large
fr: JSON trop grand
ko: JSON이 너무 큼
tr: JSON Çok Büyük
vi: JSON quá lớn
zh_hans: JSON 过大
zh_hant: JSON 過大

source: No Queries Match
fr: Aucune correspondance de requêtes
ko: 일치하는 쿼리 없음
tr: Eşleşen Sorgu Yok
vi: Không có truy vấn khớp
zh_hans: 没有匹配的查询
zh_hant: 沒有相符的查詢

source: 1 John Doe john@example.com NULL
fr: 1 John Doe john@example.com NUL

source: Read schema and run SELECT queries.
fr: Lisez le schéma et exécutez des requêtes SELECT.
ko: 스키마를 읽고 SELECT 쿼리를 실행합니다.
tr: Şemayı oku ve SELECT sorguları çalıştır.
vi: Đọc schema và chạy truy vấn SELECT.
zh_hans: 读取架构并运行 SELECT 查询。
zh_hant: 讀取綱要並執行 SELECT 查詢。

source: User and role changes were not authorized
fr: Les changements d'utilisateur et de rôle n'ont pas été autorisés.
ko: 사용자 및 역할 변경이 승인되지 않았습니다
tr: Kullanıcı ve rol değişikliklerine izin verilmedi
vi: Các thay đổi người dùng và vai trò không được cho phép
zh_hans: 用户和角色更改未获授权
zh_hant: 使用者與角色變更未獲授權

source: Execution: %.3fms
fr: Exécution : %.3fms
ko: 실행 시간: %.3fms
tr: Çalıştırma: %.3fms
vi: Thực thi: %.3fms
zh_hans: 执行: %.3fms
zh_hant: 執行：%.3fms

source: Not supported by the target
fr: Non pris en charge par la cible
ko: 대상에서 지원하지 않음
tr: Hedef tarafından desteklenmiyor
vi: Đích không hỗ trợ
zh_hans: 目标不支持
zh_hant: 目標不支援

source: No statement is allowed to run.
fr: Aucune déclaration n'est autorisée à être exécutée.

source: Invalid LSP response
fr: Réponse LSP invalide
ko: 잘못된 LSP 응답
tr: Geçersiz LSP yanıtı
vi: Phản hồi LSP không hợp lệ
zh_hans: 无效的 LSP 响应
zh_hant: LSP 回應無效

source: Confirm
fr: Confirmer
ko: 확인
tr: Onayla
vi: Xác nhận
zh_hans: 确认
zh_hant: 確認

source: Action Failed
fr: Action échouée
ko: 작업 실패
tr: İşlem Başarısız
vi: Thao tác thất bại
zh_hans: 操作失败
zh_hant: 操作失敗

source: Shortcut Conflict
fr: Conflit de raccourcis
ko: 단축키 충돌
tr: Kısayol Çakışması
vi: Xung đột phím tắt
zh_hans: 快捷键冲突
zh_hant: 快速鍵衝突

source: List databases available on a connection.
fr: Liste des bases de données disponibles sur une connexion.
ko: 연결에서 사용할 수 있는 데이터베이스를 나열합니다.
tr: Bir bağlantıda kullanılabilir veritabanlarını listeler.
vi: Liệt kê các cơ sở dữ liệu khả dụng trên một kết nối.
zh_hans: 列出连接上可用的数据库。
zh_hant: 列出連線上可用的資料庫。

source: Include Every Table
fr: Inclure toutes les tables
ko: 모든 테이블 포함
tr: Her Tabloyu Dahil Et
vi: Bao gồm mọi bảng
zh_hans: 包含所有表
zh_hant: 納入所有資料表

source: Claude Code %@ is too old
fr: Claude Code %@ est trop vieux

source: Paste a connection URL to detect type and pre-fill fields
fr: Coller une URL de connexion pour détecter le type et remplir les champs à l'avance.
ko: 연결 URL을 붙여넣으면 유형을 감지하여 필드를 미리 채웁니다
tr: Türü algılamak ve alanları önceden doldurmak için bir bağlantı URL'si yapıştırın
vi: Dán URL kết nối để nhận diện loại và điền sẵn các trường
zh_hans: 粘贴连接 URL 以检测类型并预填字段
zh_hant: 貼上連線 URL 以偵測類型並預先填入欄位

source: Table to act on. Omit for the whole database.
fr: Table à agir sur. Omettre pour toute la base de données.
ko: 작업할 테이블입니다. 데이터베이스 전체를 대상으로 하려면 생략하십시오.
tr: Üzerinde işlem yapılacak tablo. Veritabanının tamamı için boş bırakın.
vi: Bảng cần thao tác. Bỏ trống để áp dụng cho cả cơ sở dữ liệu.
zh_hans: 要操作的表。省略则表示整个数据库。
zh_hant: 要操作的資料表。省略則表示整個資料庫。

source: Choose File > Open Quickly… and type part of a name to open a table, database, or saved query.
fr: Choisissez Fichier > Ouvrir rapidement... et tapez une partie d'un nom pour ouvrir une table, une base de données ou une requête enregistrée.
ko: 파일 > 빠르게 열기…를 선택하고 이름의 일부를 입력하여 테이블, 데이터베이스 또는 저장된 쿼리를 여세요.
tr: Bir tabloyu, veritabanını veya kayıtlı sorguyu açmak için Dosya > Hızlı Aç… öğesini seçin ve adının bir kısmını yazın.
vi: Chọn Tệp > Mở nhanh… và gõ một phần tên để mở bảng, cơ sở dữ liệu hoặc truy vấn đã lưu.
zh_hans: 选择“文件 > 快速打开…”并输入名称的一部分，即可打开表格、数据库或已保存的查询。
zh_hant: 選擇「檔案 > 快速開啟…」並輸入名稱的一部分，即可開啟表格、資料庫或已儲存的查詢。

source: Save Anyway
fr: Sauvegarder de toute façon
ko: 그래도 저장
tr: Yine de Kaydet
vi: Vẫn lưu
zh_hans: 仍然保存
zh_hant: 仍要儲存

source: (%lld hidden)
fr: (%lld masqué)
ko: (%lld개 숨김)
tr: (%lld gizli)
vi: (%lld ẩn)
zh_hans: (%lld 个已隐藏)
zh_hant: (%lld 個已隱藏)

source: The server writes the file, so it lands where the server can reach, not on this Mac.
fr: Le serveur écrit le fichier, donc il atterrit là où le serveur peut accéder, pas sur ce Mac.

source: Generate the script to see exactly what would run.
fr: Générez le script pour voir exactement ce qui s'exécuterait.
ko: 무엇이 실행될지 정확히 보려면 스크립트를 생성하십시오.
tr: Tam olarak neyin çalışacağını görmek için betiği oluşturun.
vi: Tạo script để xem chính xác những gì sẽ chạy.
zh_hans: 生成脚本以准确查看将要运行的内容。
zh_hant: 產生指令稿以準確查看將要執行的內容。

source: What to drop
fr: Que mettre en bas
ko: 삭제할 대상
tr: Neyin silineceği
vi: Thứ cần xoá
zh_hans: 要删除什么
zh_hant: 要刪除什麼

source: Include the version segment your server uses, such as /v1 or /v4.
fr: Incluez le segment de version que votre serveur utilise, tel que /v1 ou /v4.

source: “%@” now holds the current result of its query.
fr: «%@» contient maintenant le résultat actuel de sa requête.

source: ^[%lld line](inflect: true)
fr: ^[%lld ligne](inflect: vrai)

source: Include diagnostics
fr: Inclure les diagnostics
ko: 진단 정보 포함
tr: Tanılamaları dahil et
vi: Đính kèm thông tin chẩn đoán
zh_hans: 包含诊断信息
zh_hant: 包含診斷資訊

source: This query belongs to another connection. Load it in the editor to run it there.
fr: Cette requête appartient à une autre connexion. Chargez-la dans l'éditeur pour l'exécuter là-bas.
ko: 이 쿼리는 다른 연결에 속합니다. 해당 연결에서 실행하려면 편집기로 불러오십시오.
tr: Bu sorgu başka bir bağlantıya ait. Orada çalıştırmak için düzenleyicide açın.
vi: Truy vấn này thuộc về một kết nối khác. Hãy mở nó trong trình soạn thảo để chạy ở đó.
zh_hans: 此查询属于另一个连接。在编辑器中载入它以在那里运行。
zh_hant: 此查詢屬於另一個連線。在編輯器中載入它以在那裡執行。

source: Keep Changes
fr: Gardez les changements

source: Toggle Query History (⌘Y)
fr: Activer l'historique des requêtes (⌘Y)
ko: 쿼리 기록 표시/숨기기(⌘Y)
vi: Bật/tắt lịch sử truy vấn (⌘Y)
zh_hans: 切换查询历史 (⌘Y)
zh_hant: 切換查詢歷史 (⌘Y)

source: Remove Index
fr: Supprimer l'index
ko: 인덱스 제거
tr: İndeksi Kaldır
vi: Gỡ index
zh_hans: 移除索引
zh_hant: 移除索引

source: Scrolling keeps one row of tabs, the way every macOS tab bar does. Rows wraps them so nothing is off screen.
fr: Le défilement conserve une seule rangée de onglets, comme le fait chaque barre d'onglets macOS. Les rangées les enveloppent pour que rien ne soit hors écran.

source: Compare structure or data between two connections and generate the sync script.
fr: Comparez la structure ou les données entre deux connexions et générez le script de synchronisation.
ko: 두 연결 사이의 구조 또는 데이터를 비교하고 동기화 스크립트를 생성합니다.
tr: İki bağlantı arasında yapıyı veya veriyi karşılaştırın ve eşitleme betiğini oluşturun.
vi: So sánh cấu trúc hoặc dữ liệu giữa hai kết nối và tạo script đồng bộ.
zh_hans: 比较两个连接之间的结构或数据，并生成同步脚本。
zh_hant: 比較兩個連線之間的結構或資料，並產生同步指令稿。

source: No Earlier Version
fr: Aucune version antérieure

source: Use as Active Schema
fr: Utiliser comme schéma actif
ko: 활성 스키마로 사용
tr: Etkin Şema Olarak Kullan
vi: Dùng làm schema hoạt động
zh_hans: 用作活动 Schema
zh_hant: 用作使用中的綱要

source: When TablePro starts:
fr: Lorsque TablePro démarre :
ko: TablePro 시작 시:
tr: TablePro başlarken:
vi: Khi TablePro khởi động:
zh_hans: TablePro 启动时：
zh_hant: TablePro 啟動時：

source: Copy Namespace Prefix
fr: Copier le préfixe du domaine de noms
ko: 네임스페이스 접두사 복사
tr: Namespace Önekini Kopyala
vi: Sao chép tiền tố namespace
zh_hans: 复制命名空间前缀
zh_hant: 複製命名空間前綴

source: Recent
fr: Récent
ko: 최근
tr: Son Kullanılanlar
vi: Gần đây
zh_hans: 最近
zh_hant: 最近

source: Test the current connection settings
fr: Testez les paramètres de connexion actuels
ko: 현재 연결 설정 테스트
tr: Geçerli bağlantı ayarlarını test et
vi: Kiểm tra cài đặt kết nối hiện tại
zh_hans: 测试当前连接设置
zh_hant: 測試目前的連線設定

source: Assistant Options
fr: Options d'assistance

source: Optional one-line description
fr: Description facultative en une ligne
ko: 한 줄 설명(선택 사항)
tr: İsteğe bağlı tek satırlık açıklama
vi: Mô tả một dòng (tùy chọn)
zh_hans: 可选的单行描述
zh_hant: 選用的單行描述

source: Move Line Down
fr: Déplacez la ligne vers le bas
ko: 줄을 아래로 이동
tr: Satırı Aşağı Taşı
vi: Chuyển dòng xuống
zh_hans: 下移一行
zh_hant: 將該行下移

source: Select schema
fr: Sélectionner le schéma
ko: 스키마 선택
tr: Şema seçin
vi: Chọn schema
zh_hans: 选择 Schema
zh_hant: 選擇綱要

source: A run is already in progress.
fr: Une course est déjà en cours.
ko: 실행이 이미 진행 중입니다.
tr: Bir çalıştırma zaten sürüyor.
vi: Đã có một lần chạy đang diễn ra.
zh_hans: 已有运行正在进行。
zh_hant: 已有執行正在進行。

source: Add as Copy
fr: Ajouter en tant que copie
ko: 복사본으로 추가
tr: Kopya Olarak Ekle
vi: Thêm dưới dạng bản sao
zh_hans: 作为副本添加
zh_hant: 新增為副本

source: truncated
fr: tronqué
ko: 잘림
tr: kısaltıldı
vi: đã cắt ngắn
zh_hans: 已截断
zh_hant: 已截斷

source: Move File to Trash
fr: Déplacer le fichier dans la corbeille
ko: 파일을 휴지통으로 이동
tr: Dosyayı Çöp Sepetine Taşı
vi: Chuyển tệp vào Thùng rác
zh_hans: 将文件移到废纸篓
zh_hant: 將檔案移到垃圾桶

source: Focus the query editor to insert
fr: Concentrez-vous sur l'éditeur de requêtes pour insérer
ko: 삽입할 쿼리 편집기에 포커스
tr: Eklemek için sorgu düzenleyicisine odaklanın
vi: Chuyển đến trình soạn thảo truy vấn để chèn
zh_hans: 聚焦查询编辑器以插入
zh_hant: 聚焦查詢編輯器以插入

source: No materialized views
fr: Aucune vue matérialisée
ko: 구체화된 뷰 없음
tr: Somutlaştırılmış görünüm yok
vi: Không có materialized view
zh_hans: 没有物化视图
zh_hant: 沒有具體化檢視表

source: Save this comparison
fr: Enregistrer cette comparaison

source: Account
fr: Compte
ko: 계정
tr: Hesap
vi: Tài khoản
zh_hans: 账户
zh_hant: 帳號

source: Filtering…
fr: Filtre...

source: Open Table
fr: Table ouverte
ko: 테이블 열기
tr: Tabloyu Aç
vi: Mở bảng
zh_hans: 打开表
zh_hant: 開啟資料表

source: Download and install updates automatically
fr: Téléchargez et installez automatiquement les mises à jour.

source: Planning time
fr: Temps de planification
ko: 계획 수립 시간
tr: Planlama süresi
vi: Thời gian lập kế hoạch
zh_hans: 规划时间
zh_hant: 規劃時間

source: Whether the column is part of the primary key
fr: Que la colonne fasse partie de la clé primaire ou non
ko: 열이 기본 키의 일부인지 여부
tr: Sütunun birincil anahtarın parçası olup olmadığı
vi: Cột có thuộc khoá chính hay không
zh_hans: 该列是否属于主键
zh_hant: 該欄位是否屬於主鍵

source: Delete Line
fr: Supprimer la ligne
ko: 줄 삭제
tr: Satırı Sil
vi: Xóa dòng
zh_hans: 删除行
zh_hant: 刪除行

source: Wrap onto more rows
fr: Enroulez sur plus de rangées

source: No Highlight Rules
fr: Pas de règles de mise en évidence

source: Majority
fr: Majorité
ko: 과반수
tr: Çoğunluk

source: “%@” will be disconnected and any in-flight requests will be cancelled.
fr: «%@» sera déconnecté et toutes les requêtes en cours seront annulées.
ko: “%@”의 연결이 해제되고 진행 중인 모든 요청이 취소됩니다.
tr: "%@" bağlantısı kesilecek ve devam eden tüm istekler iptal edilecek.
vi: “%@” sẽ bị ngắt kết nối và mọi yêu cầu đang xử lý sẽ bị hủy.
zh_hans: “%@” 将被断开连接，所有进行中的请求将被取消。
zh_hant: 「%@」將會中斷連線，所有進行中的請求都會被取消。

source: Close Tabs for Other Schemas
fr: Fermer les onglets pour d'autres schémas
ko: 다른 스키마의 탭 닫기
tr: Diğer Şemaların Sekmelerini Kapat
vi: Đóng tab của các schema khác
zh_hans: 关闭其他 Schema 的标签页
zh_hant: 關閉其他綱要的分頁

source: Runs statements on the SSH server so a database file there can be read and written in place.
fr: Exécute des déclarations sur le serveur SSH afin qu'un fichier de base de données puisse être lu et écrit sur place.

source: Redacted error text when the status is error
fr: Texte d'erreur supprimé lorsque l'état est une erreur.
ko: 상태가 오류일 때 편집된 오류 텍스트
tr: Durum hata olduğunda maskelenmiş hata metni
vi: Nội dung lỗi đã lược bỏ thông tin nhạy cảm, khi trạng thái là lỗi
zh_hans: 状态为错误时经过脱敏的错误文本
zh_hant: 狀態為錯誤時經過去識別化的錯誤文字

source: Another Connection
fr: Une autre connexion
ko: 다른 연결
tr: Başka Bir Bağlantı
vi: Kết nối khác
zh_hans: 另一个连接
zh_hant: 另一個連線

source: Database Favorites
fr: Favoris de la base de données
ko: 데이터베이스 즐겨찾기
tr: Veritabanı Favorileri
vi: Cơ sở dữ liệu yêu thích
zh_hans: 数据库收藏
zh_hant: 資料庫收藏

source: Plugin was built with PluginKit version %1$lld, but version %2$lld is required. Please update the plugin.
fr: Le plugin a été construit avec la version PluginKit %1$lld, mais la version %2$lld est requise. Veuillez mettre à jour le plugin.
ko: 플러그인은 PluginKit %1$lld 버전으로 빌드되었지만 %2$lld 버전이 필요합니다. 플러그인을 업데이트하십시오.
tr: Eklenti PluginKit sürüm %lld ile oluşturuldu, ancak sürüm %lld gerekli. Lütfen eklentiyi güncelleyin.
vi: Plugin được xây dựng với PluginKit phiên bản %lld, nhưng cần phiên bản %lld. Vui lòng cập nhật plugin.
zh_hans: 插件使用 PluginKit 版本 %lld 构建，但需要版本 %lld。请更新插件。
zh_hant: 外掛是以 PluginKit 版本 %1$lld 建置的，但需要版本 %2$lld。請更新外掛。

source: Import is not supported for %@ connections.
fr: L'importation n'est pas prise en charge pour les connexions %@.
ko: %@ 연결에서는 가져오기가 지원되지 않습니다.
tr: %@ bağlantıları için içe aktarma desteklenmiyor.
vi: Không hỗ trợ nhập cho kết nối %@.
zh_hans: %@ 连接不支持导入。
zh_hant: %@ 連線不支援匯入。

source: The table is no longer reachable.
fr: La table n'est plus accessible.
ko: 테이블에 더 이상 접근할 수 없습니다.
tr: Tabloya artık erişilemiyor.
vi: Không còn truy cập được bảng này.
zh_hans: 该表已无法访问。
zh_hant: 該資料表已無法存取。

source: Release notes are on the changelog.
fr: Les notes de version sont sur le journal des modifications.

source: No schemas found
fr: Aucun schéma trouvé
ko: 스키마를 찾을 수 없음
vi: Không tìm thấy schema
zh_hans: 未找到 Schema
zh_hant: 找不到綱要

source: Export as SQL
fr: Exporter sous forme SQL
ko: SQL로 내보내기
tr: SQL Olarak Dışa Aktar
vi: Xuất dạng SQL
zh_hans: 导出为 SQL
zh_hant: 匯出為 SQL

source: Choose Destination…
fr: Choisissez la destination...
ko: 대상 선택…
tr: Hedef Seç…
vi: Chọn nơi lưu…
zh_hans: 选择目标位置…
zh_hant: 選擇目的地…

source: API Token
fr: Token API
ko: API 토큰

source: No favorites match the selected environment.
fr: Aucun favori ne correspond à l'environnement sélectionné.
ko: 선택한 환경과 일치하는 즐겨찾기가 없습니다.
tr: Seçilen ortamla eşleşen sık kullanılan yok.
vi: Không có mục yêu thích nào khớp với môi trường đã chọn.
zh_hans: 没有收藏项与所选环境匹配。
zh_hant: 沒有收藏項目符合所選環境。

source: Export %1$lld tables to %2$@
fr: Exporter les tables %1$lld vers %2$@

source: Already in the target.
fr: Déjà dans la cible.

source: Value is not in the declared enum.
fr: La valeur n'est pas dans l'énumération déclarée.
ko: 선언된 enum에 포함되지 않은 값입니다.
tr: Değer, bildirilen enum değerleri arasında değil.
vi: Giá trị không nằm trong enum đã khai báo.
zh_hans: 该值不在声明的枚举中。
zh_hant: 該值不在宣告的列舉中。

source: No node changes.
fr: Aucune modification de nœud.
ko: 노드 변경 사항이 없습니다.
tr: Düğüm değişikliği yok.
vi: Không có thay đổi nút.
zh_hans: 节点没有变化。
zh_hant: 節點沒有變更。

source: The connection is not available. Reconnect and try again.
fr: La connexion n'est pas disponible. Réconnectez-vous et réessayez.
ko: 연결을 사용할 수 없습니다. 다시 연결한 후 재시도하십시오.
tr: Bağlantı kullanılamıyor. Yeniden bağlanıp tekrar deneyin.
vi: Kết nối không khả dụng. Hãy kết nối lại và thử lại.
zh_hans: 连接不可用。请重新连接后重试。
zh_hant: 連線無法使用。請重新連線後再試一次。

source: This Host header is not allowed to reach TablePro's MCP server.
fr: Cette balise d'hôte n'est pas autorisée à atteindre le serveur MCP de TablePro.
ko: 이 Host 헤더로는 TablePro의 MCP 서버에 접근할 수 없습니다.
tr: Bu Host başlığının TablePro'nun MCP sunucusuna erişmesine izin verilmiyor.
vi: Header Host này không được phép truy cập máy chủ MCP của TablePro.
zh_hans: 不允许此 Host 头访问 TablePro 的 MCP 服务器。
zh_hant: 不允許此 Host 標頭存取 TablePro 的 MCP 伺服器。

source: No default
fr: Pas de défaut

source: Switch Database (⌘K)
fr: Changer de base de données (⌘K)
ko: 데이터베이스 전환 (⌘K)
vi: Chuyển cơ sở dữ liệu (⌘K)
zh_hans: 切换数据库 (⌘K)
zh_hant: 切換資料庫 (⌘K)

source: Batch %1$d/%2$d failed: %3$@
fr: Lot %1$d/%2$d échoué : %3$@

source: Restore and apply
fr: Restaurer et appliquer

source: No saved templates
fr: Aucun modèle enregistré
ko: 저장된 템플릿 없음
vi: Không có mẫu đã lưu
zh_hans: 无已保存的模板
zh_hant: 無已儲存的範本

source: Indexed columns in order
fr: Colonnes indexées par ordre
ko: 순서대로 나열한 인덱스 열
tr: Sırayla indekslenen sütunlar
vi: Các cột được lập chỉ mục, theo thứ tự
zh_hans: 按顺序排列的索引列
zh_hant: 按順序排列的索引欄位

source: Estimated rows
fr: Rangs estimés
ko: 예상 행
tr: Tahmini satır
vi: Số hàng ước tính
zh_hans: 估算行数
zh_hant: 估算列數

source: Explain
fr: Expliquer
ko: 설명
tr: Açıkla
vi: Giải thích
zh_hans: 解释
zh_hant: 解釋

source: Allow explicit identity values in %@
fr: Autoriser des valeurs d'identité explicites dans %@

source: Safe Mode: %@
fr: Mode sécurisé : %@
ko: 안전 모드: %@
tr: Güvenli Mod: %@
vi: Chế độ an toàn: %@
zh_hans: 安全模式：%@
zh_hant: 安全模式：%@

source: Runs the Google Cloud SQL Auth Proxy against an instance connection name.
fr: Exécute le Google Cloud SQL Auth Proxy contre un nom de connexion d'instance.

source: %@ slowest
fr: %@ le plus lent
ko: 최장 %@
tr: en yavaş %@
vi: chậm nhất %@
zh_hans: 最慢 %@
zh_hant: 最慢 %@

source: Loading one sets the source, the target, the mode and these options. The Comparisons button in the toolbar lists them too.
fr: Le chargement d'un ensemble définit la source, la cible, le mode et ces options. Le bouton Comparaisons de la barre d'outils les liste également.

source: Database file path is required
fr: Le chemin du fichier de la base de données est requis.
ko: 데이터베이스 파일 경로가 필요합니다
tr: Veritabanı dosya yolu gereklidir
vi: Cần đường dẫn tệp cơ sở dữ liệu
zh_hans: 必须填写数据库文件路径
zh_hant: 必須填寫資料庫檔案路徑

source: protected
fr: Protégé
ko: 보호됨
tr: korumalı
zh_hans: 受保护
zh_hant: 受保護

source: Jump host configuration is invalid
fr: La configuration de l'hôte de saut est invalide.
ko: 점프 호스트 구성이 올바르지 않습니다
tr: Atlama sunucusu yapılandırması geçersiz
vi: Cấu hình jump host không hợp lệ
zh_hans: 跳板主机配置无效
zh_hant: 跳板主機設定無效

source: Explain plan
fr: Expliquer le plan
ko: 실행 계획
tr: Sorgu planı
vi: Kế hoạch thực thi
zh_hans: 执行计划
zh_hant: 執行計畫

source: UPDATE Statement(s)
fr: MISE À JOUR de la(s) déclaration(s)
ko: UPDATE 문
vi: Câu lệnh UPDATE
zh_hans: UPDATE 语句
zh_hant: UPDATE 陳述式

source: Auto cleanup on startup
fr: Nettoyage automatique à démarrage
ko: 시작 시 자동 정리
tr: Başlangıçta otomatik temizlik
vi: Tự động dọn dẹp khi khởi động
zh_hans: 启动时自动清理
zh_hant: 啟動時自動清理

source: AWS is throttling requests in %@. Try again shortly.
fr: AWS limite les demandes en %@. Réessayez sous peu.

source: Save Changes
fr: Sauvegarder les modifications
ko: 변경 사항 저장
tr: Değişiklikleri Kaydet
vi: Lưu thay đổi
zh_hans: 保存更改
zh_hant: 儲存變更

source: Get Database Statistics
fr: Obtenir des statistiques de la base de données
ko: 데이터베이스 통계 가져오기
tr: Veritabanı İstatistiklerini Al
vi: Lấy thống kê cơ sở dữ liệu
zh_hans: 获取数据库统计信息
zh_hant: 取得資料庫統計資訊

source: Plugin Installation Failed
fr: Installation du plugin échouée
ko: 플러그인 설치 실패
tr: Eklenti Kurulumu Başarısız
vi: Cài đặt Plugin thất bại
zh_hans: 插件安装失败
zh_hant: 外掛安裝失敗

source: Text: %@
fr: Texte : %@
ko: 텍스트: %@
tr: Metin: %@
vi: Văn bản: %@
zh_hans: 文本：%@
zh_hant: 文字：%@

source: Close Others
fr: Fermer les autres
ko: 다른 항목 닫기
tr: Diğerlerini Kapat
vi: Đóng các tab khác
zh_hans: 关闭其他
zh_hant: 關閉其他

source: Changes from iCloud could not be saved on this device. They will download again on the next sync.
fr: Les modifications effectuées sur iCloud ne pouvaient pas être enregistrées sur cet appareil. Elles seront téléchargées à nouveau lors de la prochaine synchronisation.
ko: iCloud의 변경 사항을 이 기기에 저장하지 못했습니다. 다음 동기화 때 다시 다운로드됩니다.
tr: iCloud'daki değişiklikler bu cihaza kaydedilemedi. Bir sonraki eşitlemede yeniden indirilecek.
vi: Không thể lưu các thay đổi từ iCloud trên thiết bị này. Chúng sẽ được tải lại ở lần đồng bộ tiếp theo.
zh_hans: 无法在本设备上保存来自 iCloud 的更改。下次同步时会重新下载。
zh_hant: 無法在本裝置上儲存來自 iCloud 的變更。下次同步時會重新下載。

source: Dropping check constraint %@ stops it validating new rows.
fr: La suppression de la contrainte de contrôle %@ l'arrête de valider les nouvelles lignes.
ko: CHECK 제약 조건 %@을(를) 삭제하면 새 행에 대한 검증이 중단됩니다.
tr: %@ kontrol kısıtlamasını silmek, yeni satırları doğrulamasını durdurur.
vi: Xoá ràng buộc CHECK %@ sẽ khiến nó ngừng kiểm tra các dòng mới.
zh_hans: 删除 CHECK 约束 %@ 后，它将不再校验新行。
zh_hant: 刪除 CHECK 約束 %@ 後，它將不再驗證新列。

source: Row size:
fr: Taille de la rangée :
ko: 행 크기:
tr: Satır boyutu:
vi: Cỡ hàng:
zh_hans: 行大小：
zh_hant: 列大小：

source: No columns match “%@”
fr: Aucune colonne ne correspond à "%@"

source: Add Linked SQL Folder...
fr: Ajouter le dossier SQL lié...
ko: 연결된 SQL 폴더 추가...
tr: Bağlı SQL Klasörü Ekle...
vi: Thêm thư mục SQL liên kết...
zh_hans: 添加链接的SQL文件夹...
zh_hant: 新增連結的 SQL 資料夾…
